HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxSpu_reg.h
/**
 * \file IfxSpu_reg.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC35XA_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Spu_Registers_Cfg Spu address
 * \ingroup IfxSfr_Spu_Registers
 * 
 * \defgroup IfxSfr_Spu_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Spu_Registers_Cfg
 *
 * \defgroup IfxSfr_Spu_Registers_Cfg_Spu0 2-SPU0
 * \ingroup IfxSfr_Spu_Registers_Cfg
 *
 * \defgroup IfxSfr_Spu_Registers_Cfg_Spu1 2-SPU1
 * \ingroup IfxSfr_Spu_Registers_Cfg
 *
 *
 */
#ifndef IFXSPU_REG_H
#define IFXSPU_REG_H 1
/******************************************************************************/
#include "IfxSpu_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Spu_Registers_Cfg_BaseAddress
 * \{  */

/** \brief SPU object */
#define MODULE_SPU0 /*lint --e(923, 9078)*/ ((*(Ifx_SPU*)0xFA800000u))
#define MODULE_SPU1 /*lint --e(923, 9078)*/ ((*(Ifx_SPU*)0xFAC00000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Spu_Registers_Cfg_Spu0
 * \{  */
/** \brief 0, Clock Control */
#define SPU0_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CLC*)0xFA800000u)

/** \brief 4, Module Identification Register */
#define SPU0_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MODID*)0xFA800004u)

/** \brief 8, Status and Reporting */
#define SPU0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_STAT*)0xFA800008u)

/** \brief 30, Input DMA Configuration */
#define SPU0_ID_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_CONF*)0xFA800030u)

/** \brief 34, Input DMA Configuration 2 */
#define SPU0_ID_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_CONF2*)0xFA800034u)

/** \brief 38, Input DMA Configuration: Radar Memory */
#define SPU0_ID_RM_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_CONF*)0xFA800038u)

/** \brief 3C, Inner Loop Address Offset */
#define SPU0_ID_RM_ILO /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_ILO*)0xFA80003Cu)

/** \brief 40, Outer Loop Address Offset */
#define SPU0_ID_RM_OLO /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_OLO*)0xFA800040u)

/** \brief 44, Bin Offset Address Configuration */
#define SPU0_ID_RM_BLO /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_BLO*)0xFA800044u)

/** \brief 48, Inner and Outer Loop Repeat */
#define SPU0_ID_RM_IOLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_IOLR*)0xFA800048u)

/** \brief 4C, Bin Loop Repeat */
#define SPU0_ID_RM_BLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_BLR*)0xFA80004Cu)

/** \brief 50, Spare Configuration Register */
#define SPU0_ID_RM_ACFG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_ACFG0*)0xFA800050u)

/** \brief 54, Spare Configuration Register */
#define SPU0_ID_RM_ACFG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ID_RM_ACFG1*)0xFA800054u)

/** \brief 58, Partial-Acquisition Counter */
#define SPU0_PACTR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_PACTR*)0xFA800058u)

/** \brief 5C, Double Pass Configuration */
#define SPU0_DPASS_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_DPASS_CONF*)0xFA80005Cu)

/** \brief 60, Loader Configuration */
#define SPU0_BE0_LDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF*)0xFA800060u)

/** \brief 64, Loader Configuration Extended */
#define SPU0_BE0_LDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF2*)0xFA800064u)

/** \brief 68, Antenna Offset */
#define SPU0_BE0_ANTOFST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA800068u)
/** Alias (User Manual Name) for SPU0_BE0_ANTOFST0.
* To use register names with standard convension, please use SPU0_BE0_ANTOFST0.
*/
#define SPU0_BE0_A0_ANTOFST (SPU0_BE0_ANTOFST0)

/** \brief 6C, Antenna Offset */
#define SPU0_BE0_ANTOFST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA80006Cu)
/** Alias (User Manual Name) for SPU0_BE0_ANTOFST1.
* To use register names with standard convension, please use SPU0_BE0_ANTOFST1.
*/
#define SPU0_BE0_A1_ANTOFST (SPU0_BE0_ANTOFST1)

/** \brief 70, Antenna Offset */
#define SPU0_BE0_ANTOFST2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA800070u)
/** Alias (User Manual Name) for SPU0_BE0_ANTOFST2.
* To use register names with standard convension, please use SPU0_BE0_ANTOFST2.
*/
#define SPU0_BE0_A2_ANTOFST (SPU0_BE0_ANTOFST2)

/** \brief 74, Antenna Offset */
#define SPU0_BE0_ANTOFST3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA800074u)
/** Alias (User Manual Name) for SPU0_BE0_ANTOFST3.
* To use register names with standard convension, please use SPU0_BE0_ANTOFST3.
*/
#define SPU0_BE0_A3_ANTOFST (SPU0_BE0_ANTOFST3)

/** \brief 78, Unloader Configuration */
#define SPU0_BE0_UNLDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF*)0xFA800078u)

/** \brief 7C, Unloader Configuration 2 */
#define SPU0_BE0_UNLDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF2*)0xFA80007Cu)

/** \brief 80, Spare Configuration Register */
#define SPU0_BE0_UNLDR_ACFG /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_ACFG*)0xFA800080u)

/** \brief 84, Output Data Processor Configuration */
#define SPU0_BE0_ODP_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ODP_CONF*)0xFA800084u)

/** \brief 88, NCI Control */
#define SPU0_BE0_NCICTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_NCICTRL*)0xFA800088u)

/** \brief 8C, Summation Unit Control */
#define SPU0_BE0_SUMCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SUMCTRL*)0xFA80008Cu)

/** \brief 90, Power Summation */
#define SPU0_BE0_PWRSUM /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRSUM*)0xFA800090u)

/** \brief 94, Power Information Channel Control */
#define SPU0_BE0_PWRCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRCTRL*)0xFA800094u)

