HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxSpu_reg.h
/** \brief 98, CFAR Module Control */
#define SPU0_BE0_CFARCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_CFARCTRL*)0xFA800098u)

/** \brief 9C, Sideband Control */
#define SPU0_BE0_SBCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SBCTRL*)0xFA80009Cu)

/** \brief A0, Loader Configuration */
#define SPU0_BE1_LDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF*)0xFA8000A0u)

/** \brief A4, Loader Configuration Extended */
#define SPU0_BE1_LDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF2*)0xFA8000A4u)

/** \brief A8, Antenna Offset */
#define SPU0_BE1_ANTOFST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA8000A8u)
/** Alias (User Manual Name) for SPU0_BE1_ANTOFST0.
* To use register names with standard convension, please use SPU0_BE1_ANTOFST0.
*/
#define SPU0_BE1_A0_ANTOFST (SPU0_BE1_ANTOFST0)

/** \brief AC, Antenna Offset */
#define SPU0_BE1_ANTOFST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA8000ACu)
/** Alias (User Manual Name) for SPU0_BE1_ANTOFST1.
* To use register names with standard convension, please use SPU0_BE1_ANTOFST1.
*/
#define SPU0_BE1_A1_ANTOFST (SPU0_BE1_ANTOFST1)

/** \brief B0, Antenna Offset */
#define SPU0_BE1_ANTOFST2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA8000B0u)
/** Alias (User Manual Name) for SPU0_BE1_ANTOFST2.
* To use register names with standard convension, please use SPU0_BE1_ANTOFST2.
*/
#define SPU0_BE1_A2_ANTOFST (SPU0_BE1_ANTOFST2)

/** \brief B4, Antenna Offset */
#define SPU0_BE1_ANTOFST3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA8000B4u)
/** Alias (User Manual Name) for SPU0_BE1_ANTOFST3.
* To use register names with standard convension, please use SPU0_BE1_ANTOFST3.
*/
#define SPU0_BE1_A3_ANTOFST (SPU0_BE1_ANTOFST3)

/** \brief B8, Unloader Configuration */
#define SPU0_BE1_UNLDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF*)0xFA8000B8u)

/** \brief BC, Unloader Configuration 2 */
#define SPU0_BE1_UNLDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF2*)0xFA8000BCu)

/** \brief C0, Spare Configuration Register */
#define SPU0_BE1_UNLDR_ACFG /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_ACFG*)0xFA8000C0u)

/** \brief C4, Output Data Processor Configuration */
#define SPU0_BE1_ODP_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ODP_CONF*)0xFA8000C4u)

/** \brief C8, NCI Control */
#define SPU0_BE1_NCICTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_NCICTRL*)0xFA8000C8u)

/** \brief CC, Summation Unit Control */
#define SPU0_BE1_SUMCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SUMCTRL*)0xFA8000CCu)

/** \brief D0, Power Summation */
#define SPU0_BE1_PWRSUM /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRSUM*)0xFA8000D0u)

/** \brief D4, Power Information Channel Control */
#define SPU0_BE1_PWRCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRCTRL*)0xFA8000D4u)

/** \brief D8, CFAR Module Control */
#define SPU0_BE1_CFARCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_CFARCTRL*)0xFA8000D8u)

/** \brief DC, Sideband Control */
#define SPU0_BE1_SBCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SBCTRL*)0xFA8000DCu)

/** \brief E0, Bin Rejection Mask */
#define SPU0_BIN_REJ0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000E0u)
/** Alias (User Manual Name) for SPU0_BIN_REJ0.
* To use register names with standard convension, please use SPU0_BIN_REJ0.
*/
#define SPU0_BIN0_REJ (SPU0_BIN_REJ0)

/** \brief E4, Bin Rejection Mask */
#define SPU0_BIN_REJ1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000E4u)
/** Alias (User Manual Name) for SPU0_BIN_REJ1.
* To use register names with standard convension, please use SPU0_BIN_REJ1.
*/
#define SPU0_BIN1_REJ (SPU0_BIN_REJ1)

/** \brief E8, Bin Rejection Mask */
#define SPU0_BIN_REJ2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000E8u)
/** Alias (User Manual Name) for SPU0_BIN_REJ2.
* To use register names with standard convension, please use SPU0_BIN_REJ2.
*/
#define SPU0_BIN2_REJ (SPU0_BIN_REJ2)

/** \brief EC, Bin Rejection Mask */
#define SPU0_BIN_REJ3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000ECu)
/** Alias (User Manual Name) for SPU0_BIN_REJ3.
* To use register names with standard convension, please use SPU0_BIN_REJ3.
*/
#define SPU0_BIN3_REJ (SPU0_BIN_REJ3)

/** \brief F0, Bin Rejection Mask */
#define SPU0_BIN_REJ4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000F0u)
/** Alias (User Manual Name) for SPU0_BIN_REJ4.
* To use register names with standard convension, please use SPU0_BIN_REJ4.
*/
#define SPU0_BIN4_REJ (SPU0_BIN_REJ4)

/** \brief F4, Bin Rejection Mask */
#define SPU0_BIN_REJ5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000F4u)
/** Alias (User Manual Name) for SPU0_BIN_REJ5.
* To use register names with standard convension, please use SPU0_BIN_REJ5.
*/
#define SPU0_BIN5_REJ (SPU0_BIN_REJ5)

/** \brief F8, Bin Rejection Mask */
#define SPU0_BIN_REJ6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000F8u)
/** Alias (User Manual Name) for SPU0_BIN_REJ6.
* To use register names with standard convension, please use SPU0_BIN_REJ6.
*/
#define SPU0_BIN6_REJ (SPU0_BIN_REJ6)

/** \brief FC, Bin Rejection Mask */
#define SPU0_BIN_REJ7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000FCu)
/** Alias (User Manual Name) for SPU0_BIN_REJ7.
* To use register names with standard convension, please use SPU0_BIN_REJ7.
*/
#define SPU0_BIN7_REJ (SPU0_BIN_REJ7)

/** \brief 100, Bin Rejection Mask */
#define SPU0_BIN_REJ8 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800100u)
/** Alias (User Manual Name) for SPU0_BIN_REJ8.
* To use register names with standard convension, please use SPU0_BIN_REJ8.
*/
#define SPU0_BIN8_REJ (SPU0_BIN_REJ8)

/** \brief 104, Bin Rejection Mask */
#define SPU0_BIN_REJ9 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800104u)
/** Alias (User Manual Name) for SPU0_BIN_REJ9.
* To use register names with standard convension, please use SPU0_BIN_REJ9.
*/
#define SPU0_BIN9_REJ (SPU0_BIN_REJ9)

/** \brief 108, Bin Rejection Mask */
#define SPU0_BIN_REJ10 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800108u)
/** Alias (User Manual Name) for SPU0_BIN_REJ10.
* To use register names with standard convension, please use SPU0_BIN_REJ10.
*/
#define SPU0_BIN10_REJ (SPU0_BIN_REJ10)

/** \brief 10C, Bin Rejection Mask */
#define SPU0_BIN_REJ11 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80010Cu)
/** Alias (User Manual Name) for SPU0_BIN_REJ11.
* To use register names with standard convension, please use SPU0_BIN_REJ11.
*/
#define SPU0_BIN11_REJ (SPU0_BIN_REJ11)

/** \brief 110, Bin Rejection Mask */
#define SPU0_BIN_REJ12 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800110u)
/** Alias (User Manual Name) for SPU0_BIN_REJ12.
* To use register names with standard convension, please use SPU0_BIN_REJ12.
*/
#define SPU0_BIN12_REJ (SPU0_BIN_REJ12)

/** \brief 114, Bin Rejection Mask */
#define SPU0_BIN_REJ13 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800114u)
/** Alias (User Manual Name) for SPU0_BIN_REJ13.
* To use register names with standard convension, please use SPU0_BIN_REJ13.
*/
#define SPU0_BIN13_REJ (SPU0_BIN_REJ13)

