HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxSpu_reg.h
/** \brief 118, Bin Rejection Mask */
#define SPU0_BIN_REJ14 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800118u)
/** Alias (User Manual Name) for SPU0_BIN_REJ14.
* To use register names with standard convension, please use SPU0_BIN_REJ14.
*/
#define SPU0_BIN14_REJ (SPU0_BIN_REJ14)

/** \brief 11C, Bin Rejection Mask */
#define SPU0_BIN_REJ15 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80011Cu)
/** Alias (User Manual Name) for SPU0_BIN_REJ15.
* To use register names with standard convension, please use SPU0_BIN_REJ15.
*/
#define SPU0_BIN15_REJ (SPU0_BIN_REJ15)

/** \brief 120, Bin Rejection Mask */
#define SPU0_BIN_REJ16 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800120u)
/** Alias (User Manual Name) for SPU0_BIN_REJ16.
* To use register names with standard convension, please use SPU0_BIN_REJ16.
*/
#define SPU0_BIN16_REJ (SPU0_BIN_REJ16)

/** \brief 124, Bin Rejection Mask */
#define SPU0_BIN_REJ17 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800124u)
/** Alias (User Manual Name) for SPU0_BIN_REJ17.
* To use register names with standard convension, please use SPU0_BIN_REJ17.
*/
#define SPU0_BIN17_REJ (SPU0_BIN_REJ17)

/** \brief 128, Bin Rejection Mask */
#define SPU0_BIN_REJ18 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800128u)
/** Alias (User Manual Name) for SPU0_BIN_REJ18.
* To use register names with standard convension, please use SPU0_BIN_REJ18.
*/
#define SPU0_BIN18_REJ (SPU0_BIN_REJ18)

/** \brief 12C, Bin Rejection Mask */
#define SPU0_BIN_REJ19 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80012Cu)
/** Alias (User Manual Name) for SPU0_BIN_REJ19.
* To use register names with standard convension, please use SPU0_BIN_REJ19.
*/
#define SPU0_BIN19_REJ (SPU0_BIN_REJ19)

/** \brief 130, Bin Rejection Mask */
#define SPU0_BIN_REJ20 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800130u)
/** Alias (User Manual Name) for SPU0_BIN_REJ20.
* To use register names with standard convension, please use SPU0_BIN_REJ20.
*/
#define SPU0_BIN20_REJ (SPU0_BIN_REJ20)

/** \brief 134, Bin Rejection Mask */
#define SPU0_BIN_REJ21 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800134u)
/** Alias (User Manual Name) for SPU0_BIN_REJ21.
* To use register names with standard convension, please use SPU0_BIN_REJ21.
*/
#define SPU0_BIN21_REJ (SPU0_BIN_REJ21)

/** \brief 138, Bin Rejection Mask */
#define SPU0_BIN_REJ22 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800138u)
/** Alias (User Manual Name) for SPU0_BIN_REJ22.
* To use register names with standard convension, please use SPU0_BIN_REJ22.
*/
#define SPU0_BIN22_REJ (SPU0_BIN_REJ22)

/** \brief 13C, Bin Rejection Mask */
#define SPU0_BIN_REJ23 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80013Cu)
/** Alias (User Manual Name) for SPU0_BIN_REJ23.
* To use register names with standard convension, please use SPU0_BIN_REJ23.
*/
#define SPU0_BIN23_REJ (SPU0_BIN_REJ23)

/** \brief 140, Bin Rejection Mask */
#define SPU0_BIN_REJ24 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800140u)
/** Alias (User Manual Name) for SPU0_BIN_REJ24.
* To use register names with standard convension, please use SPU0_BIN_REJ24.
*/
#define SPU0_BIN24_REJ (SPU0_BIN_REJ24)

/** \brief 144, Bin Rejection Mask */
#define SPU0_BIN_REJ25 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800144u)
/** Alias (User Manual Name) for SPU0_BIN_REJ25.
* To use register names with standard convension, please use SPU0_BIN_REJ25.
*/
#define SPU0_BIN25_REJ (SPU0_BIN_REJ25)

/** \brief 148, Bin Rejection Mask */
#define SPU0_BIN_REJ26 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800148u)
/** Alias (User Manual Name) for SPU0_BIN_REJ26.
* To use register names with standard convension, please use SPU0_BIN_REJ26.
*/
#define SPU0_BIN26_REJ (SPU0_BIN_REJ26)

/** \brief 14C, Bin Rejection Mask */
#define SPU0_BIN_REJ27 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80014Cu)
/** Alias (User Manual Name) for SPU0_BIN_REJ27.
* To use register names with standard convension, please use SPU0_BIN_REJ27.
*/
#define SPU0_BIN27_REJ (SPU0_BIN_REJ27)

/** \brief 150, Bin Rejection Mask */
#define SPU0_BIN_REJ28 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800150u)
/** Alias (User Manual Name) for SPU0_BIN_REJ28.
* To use register names with standard convension, please use SPU0_BIN_REJ28.
*/
#define SPU0_BIN28_REJ (SPU0_BIN_REJ28)

/** \brief 154, Bin Rejection Mask */
#define SPU0_BIN_REJ29 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800154u)
/** Alias (User Manual Name) for SPU0_BIN_REJ29.
* To use register names with standard convension, please use SPU0_BIN_REJ29.
*/
#define SPU0_BIN29_REJ (SPU0_BIN_REJ29)

/** \brief 158, Bin Rejection Mask */
#define SPU0_BIN_REJ30 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800158u)
/** Alias (User Manual Name) for SPU0_BIN_REJ30.
* To use register names with standard convension, please use SPU0_BIN_REJ30.
*/
#define SPU0_BIN30_REJ (SPU0_BIN_REJ30)

/** \brief 15C, Bin Rejection Mask */
#define SPU0_BIN_REJ31 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80015Cu)
/** Alias (User Manual Name) for SPU0_BIN_REJ31.
* To use register names with standard convension, please use SPU0_BIN_REJ31.
*/
#define SPU0_BIN31_REJ (SPU0_BIN_REJ31)

/** \brief 160, Bin Rejection Mask */
#define SPU0_BIN_REJ32 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800160u)
/** Alias (User Manual Name) for SPU0_BIN_REJ32.
* To use register names with standard convension, please use SPU0_BIN_REJ32.
*/
#define SPU0_BIN32_REJ (SPU0_BIN_REJ32)

/** \brief 164, Bin Rejection Mask */
#define SPU0_BIN_REJ33 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800164u)
/** Alias (User Manual Name) for SPU0_BIN_REJ33.
* To use register names with standard convension, please use SPU0_BIN_REJ33.
*/
#define SPU0_BIN33_REJ (SPU0_BIN_REJ33)

/** \brief 168, Bin Rejection Mask */
#define SPU0_BIN_REJ34 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800168u)
/** Alias (User Manual Name) for SPU0_BIN_REJ34.
* To use register names with standard convension, please use SPU0_BIN_REJ34.
*/
#define SPU0_BIN34_REJ (SPU0_BIN_REJ34)

