HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxSpu_reg.h
/** \brief 254, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800254u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT11.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT11.
*/
#define SPU0_MD0_MASK11_ACCEPT (SPU0_MD0_MASK_ACCEPT11)

/** \brief 258, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800258u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT12.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT12.
*/
#define SPU0_MD0_MASK12_ACCEPT (SPU0_MD0_MASK_ACCEPT12)

/** \brief 25C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80025Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT13.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT13.
*/
#define SPU0_MD0_MASK13_ACCEPT (SPU0_MD0_MASK_ACCEPT13)

/** \brief 260, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800260u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT14.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT14.
*/
#define SPU0_MD0_MASK14_ACCEPT (SPU0_MD0_MASK_ACCEPT14)

/** \brief 264, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800264u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT15.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT15.
*/
#define SPU0_MD0_MASK15_ACCEPT (SPU0_MD0_MASK_ACCEPT15)

/** \brief 268, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800268u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT16.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT16.
*/
#define SPU0_MD0_MASK16_ACCEPT (SPU0_MD0_MASK_ACCEPT16)

/** \brief 26C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80026Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT17.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT17.
*/
#define SPU0_MD0_MASK17_ACCEPT (SPU0_MD0_MASK_ACCEPT17)

/** \brief 270, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800270u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT18.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT18.
*/
#define SPU0_MD0_MASK18_ACCEPT (SPU0_MD0_MASK_ACCEPT18)

/** \brief 274, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800274u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT19.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT19.
*/
#define SPU0_MD0_MASK19_ACCEPT (SPU0_MD0_MASK_ACCEPT19)

/** \brief 278, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800278u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT20.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT20.
*/
#define SPU0_MD0_MASK20_ACCEPT (SPU0_MD0_MASK_ACCEPT20)

/** \brief 27C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80027Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT21.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT21.
*/
#define SPU0_MD0_MASK21_ACCEPT (SPU0_MD0_MASK_ACCEPT21)

/** \brief 280, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800280u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT22.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT22.
*/
#define SPU0_MD0_MASK22_ACCEPT (SPU0_MD0_MASK_ACCEPT22)

/** \brief 284, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800284u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT23.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT23.
*/
#define SPU0_MD0_MASK23_ACCEPT (SPU0_MD0_MASK_ACCEPT23)

/** \brief 288, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT24 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800288u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT24.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT24.
*/
#define SPU0_MD0_MASK24_ACCEPT (SPU0_MD0_MASK_ACCEPT24)

/** \brief 28C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT25 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80028Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT25.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT25.
*/
#define SPU0_MD0_MASK25_ACCEPT (SPU0_MD0_MASK_ACCEPT25)

/** \brief 290, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT26 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800290u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT26.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT26.
*/
#define SPU0_MD0_MASK26_ACCEPT (SPU0_MD0_MASK_ACCEPT26)

/** \brief 294, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT27 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800294u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT27.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT27.
*/
#define SPU0_MD0_MASK27_ACCEPT (SPU0_MD0_MASK_ACCEPT27)

/** \brief 298, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT28 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800298u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT28.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT28.
*/
#define SPU0_MD0_MASK28_ACCEPT (SPU0_MD0_MASK_ACCEPT28)

/** \brief 29C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT29 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80029Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT29.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT29.
*/
#define SPU0_MD0_MASK29_ACCEPT (SPU0_MD0_MASK_ACCEPT29)

/** \brief 2A0, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT30 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA8002A0u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT30.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT30.
*/
#define SPU0_MD0_MASK30_ACCEPT (SPU0_MD0_MASK_ACCEPT30)

/** \brief 2A4, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT31 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA8002A4u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT31.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT31.
*/
#define SPU0_MD0_MASK31_ACCEPT (SPU0_MD0_MASK_ACCEPT31)

