HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxSpu_reg.h
/** \brief F8, Bin Rejection Mask */
#define SPU1_BIN_REJ6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000F8u)
/** Alias (User Manual Name) for SPU1_BIN_REJ6.
* To use register names with standard convension, please use SPU1_BIN_REJ6.
*/
#define SPU1_BIN6_REJ (SPU1_BIN_REJ6)

/** \brief FC, Bin Rejection Mask */
#define SPU1_BIN_REJ7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC000FCu)
/** Alias (User Manual Name) for SPU1_BIN_REJ7.
* To use register names with standard convension, please use SPU1_BIN_REJ7.
*/
#define SPU1_BIN7_REJ (SPU1_BIN_REJ7)

/** \brief 100, Bin Rejection Mask */
#define SPU1_BIN_REJ8 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00100u)
/** Alias (User Manual Name) for SPU1_BIN_REJ8.
* To use register names with standard convension, please use SPU1_BIN_REJ8.
*/
#define SPU1_BIN8_REJ (SPU1_BIN_REJ8)

/** \brief 104, Bin Rejection Mask */
#define SPU1_BIN_REJ9 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00104u)
/** Alias (User Manual Name) for SPU1_BIN_REJ9.
* To use register names with standard convension, please use SPU1_BIN_REJ9.
*/
#define SPU1_BIN9_REJ (SPU1_BIN_REJ9)

/** \brief 108, Bin Rejection Mask */
#define SPU1_BIN_REJ10 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00108u)
/** Alias (User Manual Name) for SPU1_BIN_REJ10.
* To use register names with standard convension, please use SPU1_BIN_REJ10.
*/
#define SPU1_BIN10_REJ (SPU1_BIN_REJ10)

/** \brief 10C, Bin Rejection Mask */
#define SPU1_BIN_REJ11 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0010Cu)
/** Alias (User Manual Name) for SPU1_BIN_REJ11.
* To use register names with standard convension, please use SPU1_BIN_REJ11.
*/
#define SPU1_BIN11_REJ (SPU1_BIN_REJ11)

/** \brief 110, Bin Rejection Mask */
#define SPU1_BIN_REJ12 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00110u)
/** Alias (User Manual Name) for SPU1_BIN_REJ12.
* To use register names with standard convension, please use SPU1_BIN_REJ12.
*/
#define SPU1_BIN12_REJ (SPU1_BIN_REJ12)

/** \brief 114, Bin Rejection Mask */
#define SPU1_BIN_REJ13 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00114u)
/** Alias (User Manual Name) for SPU1_BIN_REJ13.
* To use register names with standard convension, please use SPU1_BIN_REJ13.
*/
#define SPU1_BIN13_REJ (SPU1_BIN_REJ13)

/** \brief 118, Bin Rejection Mask */
#define SPU1_BIN_REJ14 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00118u)
/** Alias (User Manual Name) for SPU1_BIN_REJ14.
* To use register names with standard convension, please use SPU1_BIN_REJ14.
*/
#define SPU1_BIN14_REJ (SPU1_BIN_REJ14)

/** \brief 11C, Bin Rejection Mask */
#define SPU1_BIN_REJ15 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0011Cu)
/** Alias (User Manual Name) for SPU1_BIN_REJ15.
* To use register names with standard convension, please use SPU1_BIN_REJ15.
*/
#define SPU1_BIN15_REJ (SPU1_BIN_REJ15)

/** \brief 120, Bin Rejection Mask */
#define SPU1_BIN_REJ16 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00120u)
/** Alias (User Manual Name) for SPU1_BIN_REJ16.
* To use register names with standard convension, please use SPU1_BIN_REJ16.
*/
#define SPU1_BIN16_REJ (SPU1_BIN_REJ16)

/** \brief 124, Bin Rejection Mask */
#define SPU1_BIN_REJ17 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00124u)
/** Alias (User Manual Name) for SPU1_BIN_REJ17.
* To use register names with standard convension, please use SPU1_BIN_REJ17.
*/
#define SPU1_BIN17_REJ (SPU1_BIN_REJ17)

/** \brief 128, Bin Rejection Mask */
#define SPU1_BIN_REJ18 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00128u)
/** Alias (User Manual Name) for SPU1_BIN_REJ18.
* To use register names with standard convension, please use SPU1_BIN_REJ18.
*/
#define SPU1_BIN18_REJ (SPU1_BIN_REJ18)

/** \brief 12C, Bin Rejection Mask */
#define SPU1_BIN_REJ19 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0012Cu)
/** Alias (User Manual Name) for SPU1_BIN_REJ19.
* To use register names with standard convension, please use SPU1_BIN_REJ19.
*/
#define SPU1_BIN19_REJ (SPU1_BIN_REJ19)

/** \brief 130, Bin Rejection Mask */
#define SPU1_BIN_REJ20 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00130u)
/** Alias (User Manual Name) for SPU1_BIN_REJ20.
* To use register names with standard convension, please use SPU1_BIN_REJ20.
*/
#define SPU1_BIN20_REJ (SPU1_BIN_REJ20)

/** \brief 134, Bin Rejection Mask */
#define SPU1_BIN_REJ21 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00134u)
/** Alias (User Manual Name) for SPU1_BIN_REJ21.
* To use register names with standard convension, please use SPU1_BIN_REJ21.
*/
#define SPU1_BIN21_REJ (SPU1_BIN_REJ21)

/** \brief 138, Bin Rejection Mask */
#define SPU1_BIN_REJ22 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00138u)
/** Alias (User Manual Name) for SPU1_BIN_REJ22.
* To use register names with standard convension, please use SPU1_BIN_REJ22.
*/
#define SPU1_BIN22_REJ (SPU1_BIN_REJ22)

/** \brief 13C, Bin Rejection Mask */
#define SPU1_BIN_REJ23 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0013Cu)
/** Alias (User Manual Name) for SPU1_BIN_REJ23.
* To use register names with standard convension, please use SPU1_BIN_REJ23.
*/
#define SPU1_BIN23_REJ (SPU1_BIN_REJ23)

/** \brief 140, Bin Rejection Mask */
#define SPU1_BIN_REJ24 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00140u)
/** Alias (User Manual Name) for SPU1_BIN_REJ24.
* To use register names with standard convension, please use SPU1_BIN_REJ24.
*/
#define SPU1_BIN24_REJ (SPU1_BIN_REJ24)

/** \brief 144, Bin Rejection Mask */
#define SPU1_BIN_REJ25 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00144u)
/** Alias (User Manual Name) for SPU1_BIN_REJ25.
* To use register names with standard convension, please use SPU1_BIN_REJ25.
*/
#define SPU1_BIN25_REJ (SPU1_BIN_REJ25)

/** \brief 148, Bin Rejection Mask */
#define SPU1_BIN_REJ26 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00148u)
/** Alias (User Manual Name) for SPU1_BIN_REJ26.
* To use register names with standard convension, please use SPU1_BIN_REJ26.
*/
#define SPU1_BIN26_REJ (SPU1_BIN_REJ26)

/** \brief 14C, Bin Rejection Mask */
#define SPU1_BIN_REJ27 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0014Cu)
/** Alias (User Manual Name) for SPU1_BIN_REJ27.
* To use register names with standard convension, please use SPU1_BIN_REJ27.
*/
#define SPU1_BIN27_REJ (SPU1_BIN_REJ27)

/** \brief 150, Bin Rejection Mask */
#define SPU1_BIN_REJ28 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00150u)
/** Alias (User Manual Name) for SPU1_BIN_REJ28.
* To use register names with standard convension, please use SPU1_BIN_REJ28.
*/
#define SPU1_BIN28_REJ (SPU1_BIN_REJ28)

/** \brief 154, Bin Rejection Mask */
#define SPU1_BIN_REJ29 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00154u)
/** Alias (User Manual Name) for SPU1_BIN_REJ29.
* To use register names with standard convension, please use SPU1_BIN_REJ29.
*/
#define SPU1_BIN29_REJ (SPU1_BIN_REJ29)

/** \brief 158, Bin Rejection Mask */
#define SPU1_BIN_REJ30 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00158u)
/** Alias (User Manual Name) for SPU1_BIN_REJ30.
* To use register names with standard convension, please use SPU1_BIN_REJ30.
*/
#define SPU1_BIN30_REJ (SPU1_BIN_REJ30)

/** \brief 15C, Bin Rejection Mask */
#define SPU1_BIN_REJ31 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0015Cu)
/** Alias (User Manual Name) for SPU1_BIN_REJ31.
* To use register names with standard convension, please use SPU1_BIN_REJ31.
*/
#define SPU1_BIN31_REJ (SPU1_BIN_REJ31)

/** \brief 160, Bin Rejection Mask */
#define SPU1_BIN_REJ32 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00160u)
/** Alias (User Manual Name) for SPU1_BIN_REJ32.
* To use register names with standard convension, please use SPU1_BIN_REJ32.
*/
#define SPU1_BIN32_REJ (SPU1_BIN_REJ32)

/** \brief 164, Bin Rejection Mask */
#define SPU1_BIN_REJ33 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00164u)
/** Alias (User Manual Name) for SPU1_BIN_REJ33.
* To use register names with standard convension, please use SPU1_BIN_REJ33.
*/
#define SPU1_BIN33_REJ (SPU1_BIN_REJ33)

