HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxSpu_reg.h
/** \brief 168, Bin Rejection Mask */
#define SPU1_BIN_REJ34 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00168u)
/** Alias (User Manual Name) for SPU1_BIN_REJ34.
* To use register names with standard convension, please use SPU1_BIN_REJ34.
*/
#define SPU1_BIN34_REJ (SPU1_BIN_REJ34)

/** \brief 16C, Bin Rejection Mask */
#define SPU1_BIN_REJ35 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0016Cu)
/** Alias (User Manual Name) for SPU1_BIN_REJ35.
* To use register names with standard convension, please use SPU1_BIN_REJ35.
*/
#define SPU1_BIN35_REJ (SPU1_BIN_REJ35)

/** \brief 170, Bin Rejection Mask */
#define SPU1_BIN_REJ36 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00170u)
/** Alias (User Manual Name) for SPU1_BIN_REJ36.
* To use register names with standard convension, please use SPU1_BIN_REJ36.
*/
#define SPU1_BIN36_REJ (SPU1_BIN_REJ36)

/** \brief 174, Bin Rejection Mask */
#define SPU1_BIN_REJ37 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00174u)
/** Alias (User Manual Name) for SPU1_BIN_REJ37.
* To use register names with standard convension, please use SPU1_BIN_REJ37.
*/
#define SPU1_BIN37_REJ (SPU1_BIN_REJ37)

/** \brief 178, Bin Rejection Mask */
#define SPU1_BIN_REJ38 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00178u)
/** Alias (User Manual Name) for SPU1_BIN_REJ38.
* To use register names with standard convension, please use SPU1_BIN_REJ38.
*/
#define SPU1_BIN38_REJ (SPU1_BIN_REJ38)

/** \brief 17C, Bin Rejection Mask */
#define SPU1_BIN_REJ39 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0017Cu)
/** Alias (User Manual Name) for SPU1_BIN_REJ39.
* To use register names with standard convension, please use SPU1_BIN_REJ39.
*/
#define SPU1_BIN39_REJ (SPU1_BIN_REJ39)

/** \brief 180, Bin Rejection Mask */
#define SPU1_BIN_REJ40 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00180u)
/** Alias (User Manual Name) for SPU1_BIN_REJ40.
* To use register names with standard convension, please use SPU1_BIN_REJ40.
*/
#define SPU1_BIN40_REJ (SPU1_BIN_REJ40)

/** \brief 184, Bin Rejection Mask */
#define SPU1_BIN_REJ41 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00184u)
/** Alias (User Manual Name) for SPU1_BIN_REJ41.
* To use register names with standard convension, please use SPU1_BIN_REJ41.
*/
#define SPU1_BIN41_REJ (SPU1_BIN_REJ41)

/** \brief 188, Bin Rejection Mask */
#define SPU1_BIN_REJ42 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00188u)
/** Alias (User Manual Name) for SPU1_BIN_REJ42.
* To use register names with standard convension, please use SPU1_BIN_REJ42.
*/
#define SPU1_BIN42_REJ (SPU1_BIN_REJ42)

/** \brief 18C, Bin Rejection Mask */
#define SPU1_BIN_REJ43 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0018Cu)
/** Alias (User Manual Name) for SPU1_BIN_REJ43.
* To use register names with standard convension, please use SPU1_BIN_REJ43.
*/
#define SPU1_BIN43_REJ (SPU1_BIN_REJ43)

/** \brief 190, Bin Rejection Mask */
#define SPU1_BIN_REJ44 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00190u)
/** Alias (User Manual Name) for SPU1_BIN_REJ44.
* To use register names with standard convension, please use SPU1_BIN_REJ44.
*/
#define SPU1_BIN44_REJ (SPU1_BIN_REJ44)

/** \brief 194, Bin Rejection Mask */
#define SPU1_BIN_REJ45 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00194u)
/** Alias (User Manual Name) for SPU1_BIN_REJ45.
* To use register names with standard convension, please use SPU1_BIN_REJ45.
*/
#define SPU1_BIN45_REJ (SPU1_BIN_REJ45)

/** \brief 198, Bin Rejection Mask */
#define SPU1_BIN_REJ46 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC00198u)
/** Alias (User Manual Name) for SPU1_BIN_REJ46.
* To use register names with standard convension, please use SPU1_BIN_REJ46.
*/
#define SPU1_BIN46_REJ (SPU1_BIN_REJ46)

/** \brief 19C, Bin Rejection Mask */
#define SPU1_BIN_REJ47 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC0019Cu)
/** Alias (User Manual Name) for SPU1_BIN_REJ47.
* To use register names with standard convension, please use SPU1_BIN_REJ47.
*/
#define SPU1_BIN47_REJ (SPU1_BIN_REJ47)

/** \brief 1A0, Bin Rejection Mask */
#define SPU1_BIN_REJ48 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001A0u)
/** Alias (User Manual Name) for SPU1_BIN_REJ48.
* To use register names with standard convension, please use SPU1_BIN_REJ48.
*/
#define SPU1_BIN48_REJ (SPU1_BIN_REJ48)

/** \brief 1A4, Bin Rejection Mask */
#define SPU1_BIN_REJ49 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001A4u)
/** Alias (User Manual Name) for SPU1_BIN_REJ49.
* To use register names with standard convension, please use SPU1_BIN_REJ49.
*/
#define SPU1_BIN49_REJ (SPU1_BIN_REJ49)

/** \brief 1A8, Bin Rejection Mask */
#define SPU1_BIN_REJ50 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001A8u)
/** Alias (User Manual Name) for SPU1_BIN_REJ50.
* To use register names with standard convension, please use SPU1_BIN_REJ50.
*/
#define SPU1_BIN50_REJ (SPU1_BIN_REJ50)

/** \brief 1AC, Bin Rejection Mask */
#define SPU1_BIN_REJ51 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001ACu)
/** Alias (User Manual Name) for SPU1_BIN_REJ51.
* To use register names with standard convension, please use SPU1_BIN_REJ51.
*/
#define SPU1_BIN51_REJ (SPU1_BIN_REJ51)

/** \brief 1B0, Bin Rejection Mask */
#define SPU1_BIN_REJ52 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001B0u)
/** Alias (User Manual Name) for SPU1_BIN_REJ52.
* To use register names with standard convension, please use SPU1_BIN_REJ52.
*/
#define SPU1_BIN52_REJ (SPU1_BIN_REJ52)

/** \brief 1B4, Bin Rejection Mask */
#define SPU1_BIN_REJ53 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001B4u)
/** Alias (User Manual Name) for SPU1_BIN_REJ53.
* To use register names with standard convension, please use SPU1_BIN_REJ53.
*/
#define SPU1_BIN53_REJ (SPU1_BIN_REJ53)

/** \brief 1B8, Bin Rejection Mask */
#define SPU1_BIN_REJ54 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFAC001B8u)
/** Alias (User Manual Name) for SPU1_BIN_REJ54.
* To use register names with standard convension, please use SPU1_BIN_REJ54.
*/
#define SPU1_BIN54_REJ (SPU1_BIN_REJ54)

