HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxSpu_reg.h
/** \brief 314, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT25 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC00314u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT25.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT25.
*/
#define SPU1_MD1_MASK25_ACCEPT (SPU1_MD1_MASK_ACCEPT25)

/** \brief 318, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT26 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC00318u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT26.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT26.
*/
#define SPU1_MD1_MASK26_ACCEPT (SPU1_MD1_MASK_ACCEPT26)

/** \brief 31C, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT27 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC0031Cu)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT27.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT27.
*/
#define SPU1_MD1_MASK27_ACCEPT (SPU1_MD1_MASK_ACCEPT27)

/** \brief 320, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT28 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC00320u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT28.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT28.
*/
#define SPU1_MD1_MASK28_ACCEPT (SPU1_MD1_MASK_ACCEPT28)

/** \brief 324, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT29 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC00324u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT29.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT29.
*/
#define SPU1_MD1_MASK29_ACCEPT (SPU1_MD1_MASK_ACCEPT29)

/** \brief 328, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT30 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC00328u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT30.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT30.
*/
#define SPU1_MD1_MASK30_ACCEPT (SPU1_MD1_MASK_ACCEPT30)

/** \brief 32C, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT31 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC0032Cu)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT31.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT31.
*/
#define SPU1_MD1_MASK31_ACCEPT (SPU1_MD1_MASK_ACCEPT31)

/** \brief 330, Input DMA Count */
#define SPU1_IDMCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_IDMCNT*)0xFAC00330u)

/** \brief 334, Input Buffer Memory Count */
#define SPU1_IBMCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_IBMCNT*)0xFAC00334u)

/** \brief 338, Input Buffer Memory Read Count */
#define SPU1_LDRCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_LDRCNT*)0xFAC00338u)

/** \brief 33C, FFT Load Count */
#define SPU1_FFTWCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_FFTWCNT*)0xFAC0033Cu)

/** \brief 340, FFT Unload Count */
#define SPU1_FFTRCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_FFTRCNT*)0xFAC00340u)

/** \brief 344, Output Buffer Memory Write Count */
#define SPU1_ULDRCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ULDRCNT*)0xFAC00344u)

/** \brief 348, Output Buffer Memory Read Count */
#define SPU1_ODMCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMCNT*)0xFAC00348u)

/** \brief 34C, Bin Rejection Unit Load Count */
#define SPU1_BRCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BRCNT*)0xFAC0034Cu)

/** \brief 350, CFAR Unit Load Count */
#define SPU1_CFARCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CFARCNT*)0xFAC00350u)

/** \brief 354, Output DMA Port Write Count */
#define SPU1_ODMACNT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFAC00354u)

/** \brief 358, Output DMA Port Write Count */
#define SPU1_ODMACNT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFAC00358u)

/** \brief 35C, Output DMA Port Write Count */
#define SPU1_ODMACNT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFAC0035Cu)

/** \brief 360, Output DMA Port Write Count */
#define SPU1_ODMACNT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFAC00360u)

/** \brief 364, Output DMA Port Write Count */
#define SPU1_ODMACNT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFAC00364u)

/** \brief 368, Output DMA Port Write Count */
#define SPU1_ODMACNT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFAC00368u)

/** \brief 36C, Output DMA Port Write Count */
#define SPU1_ODMACNT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFAC0036Cu)

/** \brief 370, Output DMA Port Write Count */
#define SPU1_ODMACNT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODMACNT*)0xFAC00370u)

/** \brief 374, Safety Counter Clear */
#define SPU1_CNTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CNTCLR*)0xFAC00374u)

/** \brief 378, SPU Monitor */
#define SPU1_MONITOR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MONITOR*)0xFAC00378u)

/** \brief 37C, Safety Mechanism Control Functions */
#define SPU1_SMCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_SMCTRL*)0xFAC0037Cu)

/** \brief 380, Safety Mechanism Status */
#define SPU1_SMSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_SMSTAT*)0xFAC00380u)

/** \brief 384, Safety Mechanism Control Functions (User) */
#define SPU1_SMUSER /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_SMUSER*)0xFAC00384u)

/** \brief 388, Monitor CRC Register */
#define SPU1_CRC_DATA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00388u)
/** Alias (User Manual Name) for SPU1_CRC_DATA0.
* To use register names with standard convension, please use SPU1_CRC_DATA0.
*/
#define SPU1_DATA0_CRC (SPU1_CRC_DATA0)

/** \brief 38C, Monitor CRC Register */
#define SPU1_CRC_DATA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC0038Cu)
/** Alias (User Manual Name) for SPU1_CRC_DATA1.
* To use register names with standard convension, please use SPU1_CRC_DATA1.
*/
#define SPU1_DATA1_CRC (SPU1_CRC_DATA1)

/** \brief 390, Monitor CRC Register */
#define SPU1_CRC_DATA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00390u)
/** Alias (User Manual Name) for SPU1_CRC_DATA2.
* To use register names with standard convension, please use SPU1_CRC_DATA2.
*/
#define SPU1_DATA2_CRC (SPU1_CRC_DATA2)

/** \brief 394, Monitor CRC Register */
#define SPU1_CRC_DATA3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFAC00394u)
/** Alias (User Manual Name) for SPU1_CRC_DATA3.
* To use register names with standard convension, please use SPU1_CRC_DATA3.
*/
#define SPU1_DATA3_CRC (SPU1_CRC_DATA3)

