HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxSpu_reg.h
/** \brief 534, Monitor CRC Register */
#define SPU1_CRC_CTRL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC00534u)
/** Alias (User Manual Name) for SPU1_CRC_CTRL13.
* To use register names with standard convension, please use SPU1_CRC_CTRL13.
*/
#define SPU1_CTRL13_CRC (SPU1_CRC_CTRL13)

/** \brief 538, Monitor CRC Register */
#define SPU1_CRC_CTRL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC00538u)
/** Alias (User Manual Name) for SPU1_CRC_CTRL14.
* To use register names with standard convension, please use SPU1_CRC_CTRL14.
*/
#define SPU1_CTRL14_CRC (SPU1_CRC_CTRL14)

/** \brief 53C, Monitor CRC Register */
#define SPU1_CRC_CTRL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC0053Cu)
/** Alias (User Manual Name) for SPU1_CRC_CTRL15.
* To use register names with standard convension, please use SPU1_CRC_CTRL15.
*/
#define SPU1_CTRL15_CRC (SPU1_CRC_CTRL15)

/** \brief 540, Monitor CRC Register */
#define SPU1_CRC_CTRL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC00540u)
/** Alias (User Manual Name) for SPU1_CRC_CTRL16.
* To use register names with standard convension, please use SPU1_CRC_CTRL16.
*/
#define SPU1_CTRL16_CRC (SPU1_CRC_CTRL16)

/** \brief 544, Monitor CRC Register */
#define SPU1_CRC_CTRL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC00544u)
/** Alias (User Manual Name) for SPU1_CRC_CTRL17.
* To use register names with standard convension, please use SPU1_CRC_CTRL17.
*/
#define SPU1_CTRL17_CRC (SPU1_CRC_CTRL17)

/** \brief 548, Monitor CRC Register */
#define SPU1_CRC_CTRL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC00548u)
/** Alias (User Manual Name) for SPU1_CRC_CTRL18.
* To use register names with standard convension, please use SPU1_CRC_CTRL18.
*/
#define SPU1_CTRL18_CRC (SPU1_CRC_CTRL18)

/** \brief 54C, Monitor CRC Register */
#define SPU1_CRC_CTRL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC0054Cu)
/** Alias (User Manual Name) for SPU1_CRC_CTRL19.
* To use register names with standard convension, please use SPU1_CRC_CTRL19.
*/
#define SPU1_CTRL19_CRC (SPU1_CRC_CTRL19)

/** \brief 550, Monitor CRC Register */
#define SPU1_CRC_CTRL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC00550u)
/** Alias (User Manual Name) for SPU1_CRC_CTRL20.
* To use register names with standard convension, please use SPU1_CRC_CTRL20.
*/
#define SPU1_CTRL20_CRC (SPU1_CRC_CTRL20)

/** \brief 554, Monitor CRC Register */
#define SPU1_CRC_CTRL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC00554u)
/** Alias (User Manual Name) for SPU1_CRC_CTRL21.
* To use register names with standard convension, please use SPU1_CRC_CTRL21.
*/
#define SPU1_CTRL21_CRC (SPU1_CRC_CTRL21)

/** \brief 558, Monitor CRC Register */
#define SPU1_CRC_CTRL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC00558u)
/** Alias (User Manual Name) for SPU1_CRC_CTRL22.
* To use register names with standard convension, please use SPU1_CRC_CTRL22.
*/
#define SPU1_CTRL22_CRC (SPU1_CRC_CTRL22)

/** \brief 55C, Monitor CRC Register */
#define SPU1_CRC_CTRL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC0055Cu)
/** Alias (User Manual Name) for SPU1_CRC_CTRL23.
* To use register names with standard convension, please use SPU1_CRC_CTRL23.
*/
#define SPU1_CTRL23_CRC (SPU1_CRC_CTRL23)

/** \brief 560, Monitor CRC Register */
#define SPU1_CRC_CTRL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFAC00560u)
/** Alias (User Manual Name) for SPU1_CRC_CTRL24.
* To use register names with standard convension, please use SPU1_CRC_CTRL24.
*/
#define SPU1_CTRL24_CRC (SPU1_CRC_CTRL24)

/** \brief 7E0, User OCDS Trace Control */
#define SPU1_USROTC /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_USROTC*)0xFAC007E0u)

/** \brief 7E4, Access Enable Register 0 */
#define SPU1_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ACCEN0*)0xFAC007E4u)

/** \brief 7E8, Access Enable Register 1 */
#define SPU1_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ACCEN1*)0xFAC007E8u)

/** \brief 7EC, OCDS Control and Status */
#define SPU1_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_OCS*)0xFAC007ECu)

/** \brief 7F0, OCDS Debug Access Register */
#define SPU1_ODA /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODA*)0xFAC007F0u)

/** \brief 7F4, Kernel Reset Register 0 */
#define SPU1_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_KRST0*)0xFAC007F4u)

/** \brief 7F8, Kernel Reset Register 1 */
#define SPU1_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_KRST1*)0xFAC007F8u)

/** \brief 7FC, Kernel Reset Clear */
#define SPU1_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_KRSTCLR*)0xFAC007FCu)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXSPU_REG_H */
